/*
               Домашнее задание по курсу MS SQL Server Developer в OTUS.

Занятие "Создание и использование CLR".                                                                            
------------------------------------------------------------------------------------------
Взять готовые исходники, скомпилировать, подключить dll, продемонстрировать использование.
------------------------------------------------------------------------------------------
*/
USE master;

/*----------------------------------------------------------------------------------------
1) исходники взяты из статьи https://habr.com/ru/post/88396/
------------------------------------------------------------------------------------------
2) в Visual Studio создано решение ClrSQL.sln, содержащее
проект CsharpCode.csproj с классом UsefulClass.cs
------------------------------------------------------------------------------------------
3) код скомпилирован в CsharpCode.dll
------------------------------------------------------------------------------------------
4) файл CsharpCode.dll размещён в D:\OTUS\CLR\
------------------------------------------------------------------------------------------
5) разрешён доступ к расширенным настройкам сервера:                                    */
EXEC sp_configure 'show advanced options', 1;
RECONFIGURE;                                                                            /*
------------------------------------------------------------------------------------------
6) включён CLR:                                                                         */
EXEC sp_configure 'clr enabled', 1;
RECONFIGURE;                                                                            /*
------------------------------------------------------------------------------------------
7) отключена проверка сертификатов/подписей:                                            */
EXEC sp_configure 'clr strict security', 0;
RECONFIGURE;                                                                            /*
------------------------------------------------------------------------------------------
8) создана сборка и подключена dll:                                                     */
CREATE ASSEMBLY CsharpCodeAssembly
FROM 'D:\OTUS\CLR\CsharpCode.dll'
WITH PERMISSION_SET = SAFE;                                                             /*
------------------------------------------------------------------------------------------
9) разрешён доступ к расширенным настройкам сервера:                                    */
EXEC sp_configure 'show advanced options', 0;
RECONFIGURE;                                                                            /*
------------------------------------------------------------------------------------------
10) создана табличная функция, использующая метод из dll:                               */
CREATE OR ALTER FUNCTION dbo.fn_SplitStringCLR
(
	@Str NVARCHAR(MAX), @Delimiter NCHAR(1)
)

RETURNS TABLE 
(
	StringPartID INT,
	StringPartContent NVARCHAR(MAX)
) 

AS 
EXTERNAL NAME [CsharpCodeAssembly].[UsefulClassNamespace.UsefulClass].SplitString;
------------------------------------------------------------------------------------------
                                                                                        /*
11) и предложен один из вариантов её использования:                                     */
SELECT *
FROM dbo.fn_SplitStringCLR(N'aa/bb/cc/dd/ee/ff/gg/hh','/');
------------------------------------------------------------------------------------------